{"sections":{"main":{"type":"main-page","disabled":true,"settings":{"padding_top":28,"padding_bottom":28}},"3b39ad34-0c42-43c9-a5cb-2488f45635e5":{"type":"page-header","settings":{"image":"shopify:\/\/shop_images\/Rectangle_4308.png","title":"About Us","margin_top":0,"margin_bottom":0,"margin_top-m":0,"margin_bottom-m":0}},"11594652-a9b6-45f9-995b-68196a4f463e":{"type":"page-heading","settings":{"color":"#000000","bg_color":"#ffffff","title":"About CBD Joint London","text":"<p>CBD Joint London is your go-to online and in-store outlet to supply you with quality vape products at everyday low prices!We bask in stocking a whopping range of Disposable Vape Devices, Vape Kits, Hardware and more. Our volume of products may seem overwhelming, however, having a large range of products is essential for us to cater to all of our customers. No Vaper is the same and we aim to serve every kind!<\/p>","margin_top":32,"margin_bottom":32,"padding_top":0,"padding_bottom":0,"margin_top-m":16,"margin_bottom-m":16,"padding_top-m":0,"padding_bottom-m":0}},"510185b3-1e85-4100-a5f6-19497967cab5":{"type":"double-image","settings":{"color":"#000000","bg_color":"#ffffff","img1":"shopify:\/\/shop_images\/Rectangle_4309.png","img2":"shopify:\/\/shop_images\/Rectangle_4309_1.png","margin_top":64,"margin_bottom":64,"padding_top":0,"padding_bottom":0,"margin_top-m":40,"margin_bottom-m":40,"padding_top-m":0,"padding_bottom-m":0}},"522fee46-02a6-4128-b425-965e528f219e":{"type":"description","settings":{"color":"#000000","bg_color":"#ffffff","title":"","text":"<p>It all began in 2014 when three founding fathers developed a plan to change the world of smoking for the better. These were simpler times when disposable devices didn’t dominate the market and the majority of products resembled a simple cig-a-like! However, with our fiercely loyal customers, our passion and determination, and a tad bit of luck… Vape Shop has grown to become one of the most reputable and well-known vaping retailers on the market. Our unwavering focus on customer satisfaction allows us to continue to grow.<br\/>Since 2017, we have helped over 10,000 people give up tobacco cigarettes for good, with approximately 5.6 million people currently vaping in the UK as of 2022.<br\/>The world of electronic cigarettes and vaping devices has evolved - and continues to grow - at a rapid rate. It can certainly be a confusing journey and we find great satisfaction in not only supplying our valued customers with high-quality products but also offering in-house support and guidance wherever needed.<br\/>We have a dedicated and knowledgeable live customer support team for all of your burning questions. Available 24 hours a day, 7 days a week, we can offer valuable expertise for any enquiries you may have. Have a question that just can’t wait? Not to worry, you can get in touch with us over the phone or via email here.<br\/>Customer safety, business legitimacy and lawfulness is essential to us. We take great pride in committing ourselves to fully TPD Complaint Products - an act brought in by the UK and European governments to regulate the advertising\/sales of electronic cigarette products. All products listed in-store and online here at Vape Shop are fully compliant with these regulations. Not only that, we are devoted to educating, informing and protecting the public against any unregulated products they may come into contact with.<br\/>Along with this, Vape Shop is an official and committed member to the UK Vaping Industry Association (UKVIA), which is the largest trade body in the UK representing the vaping sector. By being a part of the UKVIA, we can inform you, our valued customers, of the latest industry trends, news and laws.<br\/>We don’t just pride ourselves in being a vaping retailer but most importantly a community of vaping enthusiasts who vape exactly what we sell. That’s right! If we didn’t vape it, we wouldn’t sell it. You can expect 100% honesty and transparency when under our wing.<br\/>What Do Our Customers Think?<br\/>If you’d like to have a peek at what our customers think, you can check out our customer reviews here.<br\/>Thank you for stopping by and we look forward to vaping with you soon!<\/p>","margin_top":64,"margin_bottom":64,"padding_top":0,"padding_bottom":0,"margin_top-m":40,"margin_bottom-m":40,"padding_top-m":0,"padding_bottom-m":0}},"3f7e8d72-75e0-41c9-add0-402761f33e51":{"type":"custom-banner","settings":{"image":"shopify:\/\/shop_images\/Rectangle_29.png","image_m":"shopify:\/\/shop_images\/Rectangle_29_1.png","title":"Where Clouds Come to Life","btn_text":"SHOP NOW","link":"","margin_top":100,"margin_bottom":100,"margin_top-m":48,"margin_bottom-m":48}}},"order":["main","3b39ad34-0c42-43c9-a5cb-2488f45635e5","11594652-a9b6-45f9-995b-68196a4f463e","510185b3-1e85-4100-a5f6-19497967cab5","522fee46-02a6-4128-b425-965e528f219e","3f7e8d72-75e0-41c9-add0-402761f33e51"]}